In [1]:
print(45+2)

47

In [20]:
import pandas as pd

In [15]:
df = pd.read_csv("sales.csv")

In [17]:
df

,CustomerID,FirstName,LastName,Country,Gender,Age,TotalPurchase,LastPurchaseDate
0,1,James,Okoro,Nigeria,Male,32,420.50,2025-10-15
1,2,Ada,Umeh,Ghana,Female,27,380.00,2025-09-23
2,3,John,Doe,Kenya,Male,41,1020.75,2025-11-01
3,4,Mary,Adeyemi,Nigeria,Female,35,650.20,2025-10-28
4,5,Samuel,Mutiso,Kenya,Male,29,295.40,2025-08-11

In [6]:
df

,CustomerID,FirstName,LastName,Country,Gender,Age,TotalPurchase,LastPurchaseDate
0,1,James,Okoro,Nigeria,Male,32,420.50,2025-10-15
1,2,Ada,Umeh,Ghana,Female,27,380.00,2025-09-23
2,3,John,Doe,Kenya,Male,41,1020.75,2025-11-01
3,4,Mary,Adeyemi,Nigeria,Female,35,650.20,2025-10-28
4,5,Samuel,Mutiso,Kenya,Male,29,295.40,2025-08-11

In [8]:
df.info

<bound method DataFrame.info of    CustomerID FirstName LastName  Country  Gender  Age  TotalPurchase  \
0           1     James    Okoro  Nigeria    Male   32         420.50
1           2       Ada     Umeh    Ghana  Female   27         380.00
2           3      John      Doe    Kenya    Male   41        1020.75
3           4      Mary  Adeyemi  Nigeria  Female   35         650.20
4           5    Samuel   Mutiso    Kenya    Male   29         295.40

  LastPurchaseDate
0       2025-10-15
1       2025-09-23
2       2025-11-01
3       2025-10-28
4       2025-08-11  >

In [9]:
df.isna()

,CustomerID,FirstName,LastName,Country,Gender,Age,TotalPurchase,LastPurchaseDate
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [10]:
df.isna().sum()

CustomerID          0
FirstName           0
LastName            0
Country             0
Gender              0
Age                 0
TotalPurchase       0
LastPurchaseDate    0
dtype: int64

In [12]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

##summary statistics: mean ,median,maximum,minimum

In [14]:
df.describe()

       CustomerID        Age  TotalPurchase
count    5.000000   5.000000       5.000000
mean     3.000000  32.800000     553.370000
std      1.581139   5.495453     292.438125
min      1.000000  27.000000     295.400000
25%      2.000000  29.000000     380.000000
50%      3.000000  32.000000     420.500000
75%      4.000000  35.000000     650.200000
max      5.000000  41.000000    1020.750000

In [15]:
df.describe(include="object")

       FirstName LastName  Country Gender LastPurchaseDate
count          5        5        5      5                5
unique         5        5        3      2                5
top        James    Okoro  Nigeria   Male       2025-10-15
freq           1        1        2      3                1

In [17]:
import numpy as np

In [19]:
df.describe(exclude=[np.number])

       FirstName LastName  Country Gender LastPurchaseDate
count          5        5        5      5                5
unique         5        5        3      2                5
top        James    Okoro  Nigeria   Male       2025-10-15
freq           1        1        2      3                1

COLUM SELECTION

In [21]:
df.FirstName

0     James
1       Ada
2      John
3      Mary
4    Samuel
Name: FirstName, dtype: object

In [22]:
df["FirstName"]

0     James
1       Ada
2      John
3      Mary
4    Samuel
Name: FirstName, dtype: object

In [25]:
df[["FirstName", "LastName"]]

  FirstName LastName
0     James    Okoro
1       Ada     Umeh
2      John      Doe
3      Mary  Adeyemi
4    Samuel   Mutiso

In [26]:
df[["FirstName", "LastName", "Age"]]

  FirstName LastName  Age
0     James    Okoro   32
1       Ada     Umeh   27
2      John      Doe   41
3      Mary  Adeyemi   35
4    Samuel   Mutiso   29

In [27]:
##loc , iloc
## df.loc[row, col]

df.loc[0:2,["FirstName" , "LastName"]]

  FirstName LastName
0     James    Okoro
1       Ada     Umeh
2      John      Doe

In [28]:
df.loc[0:2 , :]

,CustomerID,FirstName,LastName,Country,Gender,Age,TotalPurchase,LastPurchaseDate
0,1,James,Okoro,Nigeria,Male,32,420.50,2025-10-15
1,2,Ada,Umeh,Ghana,Female,27,380.00,2025-09-23
2,3,John,Doe,Kenya,Male,41,1020.75,2025-11-01

In [29]:
df.iloc[0:2 , [1 ,2]]

  FirstName LastName
0     James    Okoro
1       Ada     Umeh

In [30]:
df.iloc [0:2, 1:3]

  FirstName LastName
0     James    Okoro
1       Ada     Umeh

In [31]:
df.iloc [0:3, 1:3]

  FirstName LastName
0     James    Okoro
1       Ada     Umeh
2      John      Doe

DATA FILTERING

import pandas as pd

In [7]:
import pandas as pd

In [11]:
import numpy as np